Revit 2024 API
Wire.HotConductorNum Property
 The hot conductor number. Its default value is zero after created.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public int HotConductorNum { get; set; }
Visual Basic
Public Property HotConductorNum As Integer
	Get
	Set
Visual C++
public:
property int HotConductorNum {
	int get ();
	void set (int value);
}
See Also
Wire Class
Autodesk.Revit.DB.Electrical Namespace